//#include<stdio.h>
//#include<stdlib.h>
//int main() {//韩信有一队兵，他想知道有多少人，便让士兵排队报数，按从1至5
//	//报数，最后一个士兵的数为1；按1至6报数，最后一个士兵报的数为5；按
//	//1至7报数，最后一个士兵报的数为4；最后再按1至11报数，最后一个士兵报的
//	//数为10，请编程计算韩信至少有多少兵
//
//	int x;
//	for (x = 1; ;x++) {
//		if ((x%5==1)&&(x%6==5)&&(x%7==4)&&(x%11==10)) {
//			printf("x=%d",x);
//			//break;//没有break跳出循环的话，程序会陷入死循环
//			exit(0);//调用exit（）函数直接结束程序运行
//		}
//	}
//}



#include<stdio.h>
int main() {
	int x;
	int find = 0;//置找到标志变量为假
	for (x = 1;!find;x++) {//find为假时继续循环，！find为真（进入循环）
		if ((x % 5 == 1) && (x % 6 == 5) && (x % 7 == 4) && (x % 11 == 10)) {
			printf("x=%d", x);
			find = 1;//置找到变量为真，此时！find就为假了，为假的话就不能进入循环了
		}
	}
	//printf("x=%d", x);  //若此语句置于for循环外的话会输出 2112
}